export const ja = `
<h1>求職エントリ</h1>

<h2>あなたは誰??</h2>

<p>
Yuta Ide(<a href="https://github.com/sadnessOjisan">@sadnessOjisan</a>), フリーターです。
普段は週1,2日くらい稼働して、残りの時間を勉強に割り当てるような暮らしをしています。
異業種からプログラマになった経緯があったり、転向後もその場しのぎのスキルアップしかできていなかったことを憂慮し、一度腰を据えて体系的に勉強しようと思いこのような生活をしています。

twitter: <a href="https://twitter.com/sadnessOjisan">https://twitter.com/sadnessOjisan</a>

blog: <a href="https://blog.ojisan.io/">https://blog.ojisan.io/</a>
</p>

<h2>仕事を探している理由</h2>

<p>
2021年12月までは勉強期間としてフリーターをしているつもりでしたが、刺激が無い生活に耐えられなくなってきたので働こうと思いました。
一人で過ごすことは一見すると自分の能力を限界まで伸ばせると思っていたのですが、勝手に自分の限界を作ってしまったり、誤った方向に進んでしまったりしているのを自覚することがあり、人や社会との繋がりが欲しくなりました。
これまでは勉強会のあとの懇親会が自分にとっての矯正機会になっていたのですが、コロナ禍でそういったものがなくなってしまったこともあり外に出ようと思いました。
時間のリミットはまだ1年ほどあるので、ゆっくりとマッチングしたいと思っておりこのエントリを書きました。
</p>

<h2>何の経験があるか</h2>

<p>
実務としてはWebフロントエンド、バックエンドアプリケーションの開発経験があります。
その中でも Web Front/BFF が比較的得意です。
</p>

<ul>
<li>React軸の開発・設計</l1>
  <ul>
    <li>Redux(+ middleware), Apollo, react-intl, styled-components...など、トレンドになったり業務で使いそうなものは一通り触っていそうな気はします。</li>
    <li>Vue/Nuxt の実務経験もありますが、あまり得意ではないです。</l1>
  </ul> 
<li>Next/Gatsby</l1>
  <ul>
    <li>3年前から実務で使っておりそれなりにトラブルシューティングができます。</l1>
     <li>反対にReactそのものはあまり得意ではないかもしれません。</l1>
     <ul>
    <li>Reactは使うだけなら問題ないですが内部実装は詳しくないです。</l1>
    <li>Reactの最新動向も追っていないです。(知識としてはhooksが限界です)</l1>
    </ul> 
  </ul> 

  <li>Babel, Webpack, ESLint, Jest などといったツールチェイン周りの整備</l1>
  <ul> 
  <li>内部実装の詳細は詳しくないですが、仕組みは知っています。</li>
  <li>0->1開発の請負経験が多く大体この辺の技術選定や設定は自分で行っていたのでそれなりの経験はあります。</li>
  <li>ただ経験はあると言っても標準的な設定しかしていないので最適化できる自信はありません。</li>
  </ul>

  <li>Firebase</l1>
  <ul>
 <li>よくブログのネタにしているものの、実務経験としては2回ほどしかなく規模も小規模です。</l1>
 <li>ただ標準的な使い方はできているとは思っています。</l1>
  </ul>
  
  <li>フロントエンドのDevOps</l1>
  <ul>
 <li>実務としてVercel, Netlify, GitHub Actions, CircleCI を使ったパイプラインの設計・開発経験があります。</l1>
 <li>GCP, AWSなどのIaaSの経験もありますが設計はできません。フロントエンドエンジニア目線で使いやすいように設定を書いたりはできます。</l1>
  </ul>
</ul>  

<p>あと、Java(Spring), Python(Flask) も実務経験としてはあります。（できるとは言っていないことに注意）</p>

<h2>何をしたいか</h2>

<p>
特に希望はないです。
どんな仕事でも環境次第では面白いし成長の源泉になると思っているからです。
反対に言うと、ただ1人で開発するような仕事だったり、アドバイザー的な仕事は望んでおらず、自分が手を動かしてそれに対して指摘がもらえる環境だと非常に嬉しいです。

強いて言うなら パフォーマンスチューニングやプログラミングそのものがドメインになるような事業などは興味があります。
特になんらかのSDKの開発はやってみたいです。
</p>

<h2>求める条件</h2>

<h3>待遇</h3>

<p>報酬については特にこちらからは希望はないです。
御社のテーブルを参考にしながら相談したいです。
</p>

<h3>勤怠</h3>

<p>
最大で月120時間までの稼働が可能ですが、少ない方が嬉しいです。
フルタイムや正社員契約も可能ですが、すでに定期的な業務委託契約があるため即座にジョインすることはできず、はじめは~週4だったりフルフレックスでお願いしたいです。
</p>

<h3>勤務地</h3>

<p>どこでも大丈夫です。都会でも田舎でも暮らせます。</p>

<h3>連絡先</h3>

<p>
TwitterDM を開けていますのでそちらから連絡をください。
職務経歴書などが必要な場合はそちらからお送りします。

あとこれまでスカウトメール的なのはわざと全部無視していたのですが、それは本当に仕事を探したいタイミングより前に気まずい関係になりたくないという理由ですので、DMいただいたらきちんと返事をさせていただきます。
めんどくさい性格で申し訳ございません。
</p>

<h2>おわりに</h2>

<p>
条件を明示していないので採用を担当される方からすればアトラクトしづらいところはあると思いますが、なんかよさそうって思ったら働こうかなくらいの温度感ですので気軽に連絡をいただけたらと思います。
しばらくぶらぶらしていますので気軽に声をかけてくれると喜びます。
</p>

`;
