export const ja = `
<h1>求職エントリ</h1>

<h2>あなたは誰</h2>

井手優太(<a href="https://github.com/sadnessOjisan">@sadnessOjisan</a>), フリーターです。
普段は低稼働な業務委託契約を一つと友人のヘルプで受託開発を週1,2日くらいの稼働で行っていて、あとはゲームしたり勉強したりしています。

<h2>仕事を探している理由</h2>

2021年12月まで(健康保険の任意継続のリミット)は勉強期間としてフリーターをしているつもりでしたが、飽き と 危機感 が生まれたからです。
一人で過ごすことで自分の成長の限界を作ったり、誤った方向に進んでしまったりしているのを自覚することが増えてきており、人や社会との繋がりが欲しくなりました。
ただ切羽は詰まっていないため職場選びはゆっくりとマッチングできればと思っており、このエントリを書きました。

<h2>何の経験があるか</h2>

Web Front/BFF が得意です。

<ul>
<li>React軸の開発・設計</l1>
  <ul>
    <li>Redux, Apollo, react-intl, styled-components...</li>
    <li>(Vue/Nuxt の実務経験もありますが、あまり得意ではないです。)</l1>
  </ul> 
<li>Next/Gatsby</l1>
  <ul>
    <li>3年前から実務で使っており挙動はそれなりに知っています。</l1>
     <li>反対にReactそのものはあまり得意ではないかもしれません。</l1>
     <ul>
    <li>Reactは使うだけなら問題ないですが内部実装は詳しくないです。</l1>
    <li>Reactの最新動向も追ってもいないです。(知識としてはhooksが限界です)</l1>
    </ul> 
  </ul> 

  <li>Babel, Webpack, ESLint, Jest などといったツールチェイン周りの整備</l1>
  <ul> 
  <li>内部実装は詳しくないですが、仕組みは知っています。</li>
  </ul>
  
  <li>フロントエンドのDevOps</l1>
  <ul>
 <li>Vercel, Netlify, Firebase, GitHub Actions, CirceCI を使ったパイプラインの設計・開発経験があります。</l1>
 <li>GCP, AWSなどのIaaSの経験やTerraformのようなIaCの開発経験もありますが設計はできません。フロントエンドエンジニア目線で使いやすいように設定を書いたりはできます。</l1>
  </ul>
</ul>  

ただ、経験があるだけで御社目線でできるかどうかは分かりません。自信があるものは何一つとしてないです。

あと、Java(Spring), Python(Flask) も実務経験としてはありますができません。
バックエンド経験があるので全体設計をフロントエンド側から作ったり見直すことはできますよアピールです。

<h2>何をしたいか</h2>

特に希望はないです。
どんな仕事でも環境次第では面白いし成長の源泉になると思っているからです。
反対に言うと、ただ1人で開発するような仕事(=今の生活)だったり、アドバイザー的な仕事は望んでおらず、自分が手を動かしてそれに対して指摘がもらえる環境だと非常に嬉しいです。

<h2>求める条件</h2>

<h3>待遇</h3>

報酬については特にこちらからは希望はないです。
御社のテーブルにお任せします。
待遇よりかは仕事の経験値や環境を価値観の中心においています。

<h3>勤怠</h3>

最大で月120時間までの稼働が可能ですが、少ない方が嬉しいです。
フルタイムや正社員契約も可能ですが、継続な業務委託契約を既に結んでいる場所があるため即座にジョインすることはできず、はじめは週4~だったりフルフレックスでお願いしたいです。

<h3>勤務地</h3>

どこでも大丈夫です。

<h3>連絡先</h3>

TwitterDM を開けていますのでそちらから連絡をください。
職務経歴書などが必要な場合はそちらからお送りします。

あとこれまでスカウトメール的なのはわざと全部無視していたのですが、それは本当に仕事を探したいタイミングより前にキマづい関係になりたくないという理由ですので、もう一度送っていただけたらきちんと返事をさせていただきます。
めんどくさい性格ですみません。

`;
